; ModuleID = 'DRB049-fprintf-orig-no.c'
source_filename = "DRB049-fprintf-orig-no.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ident_t = type { i32, i32, i32, i32, i8* }

@.str = private unnamed_addr constant [15 x i8] c"mytempfile.txt\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"a+\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [18 x i8] c"Error in fopen()\0A\00", align 1
@0 = private unnamed_addr constant [38 x i8] c";DRB049-fprintf-orig-no.c;main;69;1;;\00", align 1
@1 = private unnamed_addr constant %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([38 x i8], [38 x i8]* @0, i32 0, i32 0) }, align 8
@.str.3 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1
@2 = private unnamed_addr constant [39 x i8] c";DRB049-fprintf-orig-no.c;main;69;25;;\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 11.1.0", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "DRB049-fprintf-orig-no.c", directory: "/home/peiming/Documents/projects/OpenRace/tests/data/integration/dataracebench")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{i32 7, !"PIC Level", i32 2}
!9 = !{i32 7, !"PIE Level", i32 2}
!10 = !{!"clang version 11.1.0"}
!11 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 51, type: !12, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !18)
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !14, !15}
!14 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !{!19, !20, !21, !22, !23, !83, !84}
!19 = !DILocalVariable(name: "argc", arg: 1, scope: !11, file: !1, line: 51, type: !14)
!20 = !DILocalVariable(name: "argv", arg: 2, scope: !11, file: !1, line: 51, type: !15)
!21 = !DILocalVariable(name: "i", scope: !11, file: !1, line: 53, type: !14)
!22 = !DILocalVariable(name: "ret", scope: !11, file: !1, line: 54, type: !14)
!23 = !DILocalVariable(name: "pfile", scope: !11, file: !1, line: 55, type: !24)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !26, line: 7, baseType: !27)
!26 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !28, line: 49, size: 1728, elements: !29)
!28 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !45, !47, !48, !49, !53, !55, !57, !61, !64, !66, !69, !72, !73, !74, !78, !79}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !27, file: !28, line: 51, baseType: !14, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !27, file: !28, line: 54, baseType: !16, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !27, file: !28, line: 55, baseType: !16, size: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !27, file: !28, line: 56, baseType: !16, size: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !27, file: !28, line: 57, baseType: !16, size: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !27, file: !28, line: 58, baseType: !16, size: 64, offset: 320)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !27, file: !28, line: 59, baseType: !16, size: 64, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !27, file: !28, line: 60, baseType: !16, size: 64, offset: 448)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !27, file: !28, line: 61, baseType: !16, size: 64, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !27, file: !28, line: 64, baseType: !16, size: 64, offset: 576)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !27, file: !28, line: 65, baseType: !16, size: 64, offset: 640)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !27, file: !28, line: 66, baseType: !16, size: 64, offset: 704)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !27, file: !28, line: 68, baseType: !43, size: 64, offset: 768)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !28, line: 36, flags: DIFlagFwdDecl)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !27, file: !28, line: 70, baseType: !46, size: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !27, file: !28, line: 72, baseType: !14, size: 32, offset: 896)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !27, file: !28, line: 73, baseType: !14, size: 32, offset: 928)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !27, file: !28, line: 74, baseType: !50, size: 64, offset: 960)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !51, line: 152, baseType: !52)
!51 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!52 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !27, file: !28, line: 77, baseType: !54, size: 16, offset: 1024)
!54 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !27, file: !28, line: 78, baseType: !56, size: 8, offset: 1040)
!56 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !27, file: !28, line: 79, baseType: !58, size: 8, offset: 1048)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 1)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !27, file: !28, line: 81, baseType: !62, size: 64, offset: 1088)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !28, line: 43, baseType: null)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !27, file: !28, line: 89, baseType: !65, size: 64, offset: 1152)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !51, line: 153, baseType: !52)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !27, file: !28, line: 91, baseType: !67, size: 64, offset: 1216)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !28, line: 37, flags: DIFlagFwdDecl)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !27, file: !28, line: 92, baseType: !70, size: 64, offset: 1280)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !28, line: 38, flags: DIFlagFwdDecl)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !27, file: !28, line: 93, baseType: !46, size: 64, offset: 1344)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !27, file: !28, line: 94, baseType: !4, size: 64, offset: 1408)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !27, file: !28, line: 95, baseType: !75, size: 64, offset: 1472)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "/usr/lib/clang/11.1.0/include/stddef.h", directory: "")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !27, file: !28, line: 96, baseType: !14, size: 32, offset: 1536)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !27, file: !28, line: 98, baseType: !80, size: 160, offset: 1568)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 20)
!83 = !DILocalVariable(name: "len", scope: !11, file: !1, line: 56, type: !14)
!84 = !DILocalVariable(name: "A", scope: !11, file: !1, line: 58, type: !85)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 32000, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 1000)
!88 = !{!89, !89, i64 0}
!89 = !{!"int", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !DILocation(line: 51, column: 14, scope: !11)
!93 = !{!94, !94, i64 0}
!94 = !{!"any pointer", !90, i64 0}
!95 = !DILocation(line: 51, column: 26, scope: !11)
!96 = !DILocation(line: 53, column: 3, scope: !11)
!97 = !DILocation(line: 53, column: 7, scope: !11)
!98 = !DILocation(line: 54, column: 3, scope: !11)
!99 = !DILocation(line: 54, column: 7, scope: !11)
!100 = !DILocation(line: 55, column: 3, scope: !11)
!101 = !DILocation(line: 55, column: 9, scope: !11)
!102 = !DILocation(line: 56, column: 3, scope: !11)
!103 = !DILocation(line: 56, column: 7, scope: !11)
!104 = !DILocation(line: 58, column: 3, scope: !11)
!105 = !DILocation(line: 58, column: 7, scope: !11)
!106 = !DILocation(line: 60, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !11, file: !1, line: 60, column: 3)
!108 = !DILocation(line: 60, column: 8, scope: !107)
!109 = !DILocation(line: 60, column: 13, scope: !110)
!110 = distinct !DILexicalBlock(scope: !107, file: !1, line: 60, column: 3)
!111 = !DILocation(line: 60, column: 15, scope: !110)
!112 = !DILocation(line: 60, column: 14, scope: !110)
!113 = !DILocation(line: 60, column: 3, scope: !107)
!114 = !DILocation(line: 61, column: 10, scope: !110)
!115 = !DILocation(line: 61, column: 7, scope: !110)
!116 = !DILocation(line: 61, column: 5, scope: !110)
!117 = !DILocation(line: 61, column: 9, scope: !110)
!118 = !DILocation(line: 60, column: 21, scope: !110)
!119 = !DILocation(line: 60, column: 3, scope: !110)
!120 = distinct !{!120, !113, !121, !122}
!121 = !DILocation(line: 61, column: 10, scope: !107)
!122 = !{!"llvm.loop.unroll.disable"}
!123 = !DILocation(line: 63, column: 11, scope: !11)
!124 = !DILocation(line: 63, column: 9, scope: !11)
!125 = !DILocation(line: 64, column: 7, scope: !126)
!126 = distinct !DILexicalBlock(scope: !11, file: !1, line: 64, column: 7)
!127 = !DILocation(line: 64, column: 13, scope: !126)
!128 = !DILocation(line: 64, column: 7, scope: !11)
!129 = !DILocation(line: 66, column: 13, scope: !130)
!130 = distinct !DILexicalBlock(scope: !126, file: !1, line: 65, column: 3)
!131 = !DILocation(line: 66, column: 5, scope: !130)
!132 = !DILocation(line: 67, column: 3, scope: !130)
!133 = !DILocation(line: 69, column: 1, scope: !11)
!134 = !DILocation(line: 75, column: 10, scope: !11)
!135 = !DILocation(line: 75, column: 3, scope: !11)
!136 = !DILocation(line: 76, column: 9, scope: !11)
!137 = !DILocation(line: 76, column: 7, scope: !11)
!138 = !DILocation(line: 77, column: 7, scope: !139)
!139 = distinct !DILexicalBlock(scope: !11, file: !1, line: 77, column: 7)
!140 = !DILocation(line: 77, column: 11, scope: !139)
!141 = !DILocation(line: 77, column: 7, scope: !11)
!142 = !DILocation(line: 79, column: 13, scope: !143)
!143 = distinct !DILexicalBlock(scope: !139, file: !1, line: 78, column: 3)
!144 = !DILocation(line: 79, column: 5, scope: !143)
!145 = !DILocation(line: 80, column: 3, scope: !143)
!146 = !DILocation(line: 82, column: 1, scope: !11)
!147 = !DILocation(line: 81, column: 3, scope: !11)
!148 = distinct !DISubprogram(name: ".omp_outlined._debug__", scope: !1, file: !1, line: 70, type: !149, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !158)
!149 = !DISubroutineType(types: !150)
